{
    "url": "https://www.reddit.com/r/RedditPirates/wiki/index",
    "image": {
        "url": "https://c.tenor.com/fjvF2rcBEI0AAAAd/rules.gif"
    },
    "color": 16711680
}

{
    "description": "*The following outlines our simple but effective rules which ensures that Reddit Pirates is a safe and enjoyable place to play Clash of Clans.*\n** **\n** **\n__**The categories include:**__\n** **\n📍 General Rules\n📍 Contributions\n📍 Capital Rules\n📍 War Rules\n📍 CWL Rules\n📍 Warnings & Removals",
    "thumbnail": {
        "url": "https://cdn.discordapp.com/attachments/962341885576364092/973926060368465920/a-4c6a69b1c4f6feda26b38164e184-unscreen.gif"
    },
    "image": {
        "url": "https://cdn.discordapp.com/attachments/842741907720896512/842806312386428948/gif.gif"
    },
    "color": 16711680
}

{
    "description": "*We're a clan which focuses on wars and constantly getting better at attacks while having fun and learning together. We are pretty active in chat, especially evenings/nights EST-PST and we're always looks for anyone interested in helping strategise attacks and destroy the enemy.*\n\n**Server Legend**\nHere's a run-down of the channels present here.\n** **\n> <#258970772842872844> General clan chatter section.\n> <#526851882686087168> Sharing cool clash related content.  \n> <#786332089784074250> Get yourself role-d up! \n> <#598179915606786058> RCS related announcements.\n> <#295958575015133185> All clan related announcements.\n\n**General Rules**\n:arrow: **Language:** Keep the language clean.\n:arrow: **Requests:** Request specific levels of troops only during war.\n:arrow: **Promotions:** Promotions are earned.\n:arrow: **Activity:** Min. 400 don./season; exception for lower accounts.\n:arrow: **Rushing:** Rushing is not allowed.\n:arrow: **Season Reset:** Badge required within 1 week of season reset.\n:arrow: **Minis:** Active minis are welcome depending on available space.\n:arrow: **Max Clan Reviews:** Whenever a clan reaches 48+ players, we will assess removing accounts. Criteria includes activity, infractions or skill concerns.\n** **\n***Note:** As a member of Rogue Pirates, you will be having a relaxed subset of the general activity and donation requirement mentioned above. But they do exist.* \n",
    "thumbnail": {
        "url": "https://cdn.discordapp.com/attachments/764780425465298968/974364167190482984/red-beard-pirate-3-unscreen.gif"
    },
    "image": {
        "url": "https://cdn.discordapp.com/attachments/842741907720896512/842806312386428948/gif.gif"
    },
    "color": 16711680
}

{
    "title": "**Contribution Rules**",
    "description": "A quality of a clan is directly determined by its activity. We require all players to be actively contributing to the clan though clan castle donations, clan capital contributions and clan games.\n\n**Clan Capital**\n:arrow: **Min Contributions:** 10K in capital gold/season for all Town-halls.\n:arrow: **Raids:** In order to ensure maximum benefits out of the raid week, all members are required to use their attacks by the end of the weekend. \n\n**Clan Games**\n:arrow: Min Contributions: 1500 per clan\n:arrow: Multiple Accounts: Points may be combined for accounts within the same clan\n:arrow: Maxed Accounts: Exempt (excluding walls)\n:arrow: Donation Accounts: Exempt\n:arrow: Mini Accounts: Minis are welcome to join for games\n\n**Clan Castle**\nWe commemorate the contributions of a player as a whole to the clan when they contribute to the CC in general. However, we do have some guidelines to follow through while doing so.\n\n:arrow: **Donation Ratios:** No requirement to maintain a ratio.\n:arrow: **Max Donations:** Limit max donation requests to war.\n:arrow: **TH Limitations:** We recommend you keep to the clan specific troop levels when not for war to allow all members to contribute.\n:arrow: **Maxed Minis:** As players are not grinding their maxed mini accounts, it is known the donations will be lower.",
    "thumbnail": {
        "url": "https://cdn.discordapp.com/attachments/764780425465298968/974233594002284544/200w-unscreen.gif"
    },
    "image": {
        "url": "https://cdn.discordapp.com/attachments/842741907720896512/842806312386428948/gif.gif"
    },
    "color": 16711680
}

{
    "title": "**Clan Capital Rules**",
    "description": "Great things are never done by one person, they're done as a team... SAME goes for the capital upgrades! Below outline the rules and exceptions for the capital contributions.\n\n**Capital Upgrades**\n:arrow: **Upgrade Strategy:** Follow the upgrade strategy as posted in the capital threads & ask COs for help and/or exceptions.\n\n**Capital Raids**\n:arrow: **Strategy:** Follow the raid strategy as posted & ask COs for help and/or exceptions.\n:arrow: **Attack Order:** There is no specific attack order. Simply attack throughout the weekend when you are available.\n:arrow: **Final Attacks**: If you are the final attack on a district to secure the 3 star, from then on you MUST be either the first or second attack on a district to ensure the bonus attack goes to a different member. \n\n**General Contribution Agenda**\n:arrow: **Donations:** Minis or any other accounts that aren't in the clan may be temporarily brought into the clan for contributing capital gold. Ensure our upgrade priorities are followed.\n:arrow: **Raids:** Minis or any other accounts that aren't in the clan may be temporarily brought into the clan for participating in our capital raids. Ensure our capital raid strategies are followed.\n:arrow: **Removal:** Minis or any other accounts that aren't in the clan; must be immediately removed following donations or raids. Spaces cannot be held for those accounts. The clans are deemed \"maxed\" at 49 accounts to allow for bringing in minis. If players are found to not remove their temporary accounts in a timely fashion, they will receive a warning.",
    "thumbnail": {
        "url": "https://cdn.discordapp.com/attachments/764780425465298968/974363515768946708/red-beard-pirate-2-unscreen.gif"
    },
    "image": {
        "url": "https://cdn.discordapp.com/attachments/842741907720896512/842806312386428948/gif.gif"
    },
    "color": 16711680
}

{
    "title": "**War Rules**",
    "description": "Here at Reddit Pirates, war is the breathing spirit for the clan. We expect a full commitment in the event you are partaking in a war spun across any of our clans.\n\n:arrow: **Hero Upgrades:** No heroes, no war. If upgrading, opt out of war.\n:arrow: **Pet Upgrades:** Pet upgrades allowed during war. No need to opt out except during CWL.\n:arrow: **Attacks:** Both attacks must be used in war. If no viable stars or destruction percentage can be gained, you may practice an attack on an already attacked base to ensure the attack is used.\n:arrow: **Attack Timing:** All attacks must be completed PRIOR to the final 30 minutes of war unless approved by a CO.\n:arrow: **No Babysitting:** Our bot pings war reminders as follows: 8 hrs, 4 hrs, 6 hrs & 1 hr remaining. It is the accountability of player to get their hits in.\n:arrow: **War Requirement:** You may opt out to upgrade heroes for the majority of the season. All players need to be in war for at least 3 wars per season.\n:arrow: **Maxed Minis:** Required to war a minimum of once a week all season and participate in CWL.\n\n📍**Base Claiming**\n:arrow: **Preparation Day:** Do not claim on preparation day.\n:arrow: **How To:** Visit <#769244397123665960> for more info on working with the wm-bot\n:arrow: **Invalid:** Claims last for 2 hours, beyond which they're invalid.\n:arrow: **CWL:** Claims during CWL do not require wmbot and are done in-game. \n:arrow: **Fairness:** Claim one base at a time.\n\n⏰ **War Cycles**\n:arrow: **Pirates:** Monday/Wednesday/Friday at 8pm EST\n:arrow: **Parallax:** Tuesday/Friday/Sunday at 8pm EST\n:arrow: **Royal Pirates:** Tuesday/Friday/Sunday at 8pm EST\n:arrow: **Rogue Pirates:** Depends on the FWA cycle.\n\n",
    "thumbnail": {
        "url": "https://cdn.discordapp.com/attachments/764780425465298968/974363093985558548/200-unscreen.gif"
    },
    "image": {
        "url": "https://cdn.discordapp.com/attachments/842741907720896512/842806312386428948/gif.gif"
    },
    "color": 16711680
}

{
    "title": "**CWL Rules**",
    "description": "CWL... the best week of 'em all. Here at Reddit Pirates, CWL is a celebrated week full of intense wars.\n\n:arrow: **Sign Ups:** Sign up form will be posted during clan games, make sure to sign yourself up to participate.\n:arrow: **War Strategy:** Strategies will be posted in the event of mismatches which is bound to happen- these are taken into consideration of all factors affecting our victory on that day. Follow the war strategy as communicated. If unclear, please ask a CO in-game or on Discord.\n:arrow: **Attacks:** Attacks must be used in CWL. If you miss an attack in CWL without sufficient justification, you will be warned/retired. At CO's discretion, you may be allowed to stay but will sit the rest of CWL.\n:arrow: **Base Calling:** We use the in-game calling function to call up bases during CWL.\n:arrow: **Performance:** Participation through the week is based on consistency and performance. Weak performances are subbed out for the week in the event more subs are available. Zero or 1 star attacks will sit the next day unless there are no available rotations.\n:arrow: **Bonuses:** Bonuses are awarded based on the overall contribution of the player- filling war castles, war performances, strategy plannings at the war room and so forth. \n:arrow: **Absences:** Planned absences should be communicated in advance of CWL to plan accordingly. In case of emergencies, please let us know and we will adjust the lineup.",
    "thumbnail": {
        "url": "https://cdn.discordapp.com/attachments/764780425465298968/974334091644256286/LeagueMedal.png"
    },
    "image": {
        "url": "https://cdn.discordapp.com/attachments/842741907720896512/842806312386428948/gif.gif"
    },
    "color": 16711680
}

{
    "title": "**Warnings & Removals**",
    "description": "Failure to follow the mentioned rules will lead to warnings and sanctions; and potential removal from the clan.\n\n1️⃣ **1st Offence - Informal Warning**\nFor a first offence, we will reach out to confirm what happened. We understand you may not have known the rules. For a missed attack, perhaps a serious personal circumstance occurred. We will remind you of the rules and advise a formal warning will be issued next time.\n\n2️⃣ **2nd Offence - Formal Warning**\nIf you repeat an offence, but you have never had an official warning, we will issue a formal warning with the `!locker` command for traceability on your server profile.\n\n🔁 **Repeat Offence - Given Grace**\nIf this is a repeat offence but it hasn't happened in a long time or there is reasonable justification, the leadership team may agree to give you grace.\n\n❌ **Repeat Offence - Removal**\nIf this is a repeat offence within a short timeframe, or there are multiple other warnings for you, the leadership team may decide to remove you. You will be kicked from the clan(s) and server, and you will receive a Discord DM explaining why you have been kicked.\n\n🚨 **Rules are Tougher during CWL**\nGiven the importance of CWL, our tolerance is lower for any form of infraction. The leadership team may choose to take stricter action at any time, including immediate removal.\n",
    "thumbnail": {
        "url": "https://cdn.discordapp.com/attachments/764780425465298968/974362272472399932/red-beard-pirate-unscreen.gif"
    },
    "image": {
        "url": "https://cdn.discordapp.com/attachments/842741907720896512/842806312386428948/gif.gif"
    },
    "color": 16711680
}